src/main/resources/xml/accommodationSalesServicePort/createGroupTeamName/createGroupTeamName.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sal="http://sales.accommodation.transferobject.booking.dreams.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <sal:createGroupTeamName>
         <request>
            <groupCode>?</groupCode>
            <groupTeamViewTO>
               <!--Optional:-->
               <groupCode>?</groupCode>
               <!--Optional:-->
               <groupName>?</groupName>
               <!--Optional:-->
               <groupTeamId>?</groupTeamId>
               <!--Optional:-->
               <groupTeamName>?</groupTeamName>
               <selected>?</selected>
            </groupTeamViewTO>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </sal:createGroupTeamName>
   </soapenv:Body>
</soapenv:Envelope>
